app/controllers/geopki_controller.rb

SELECT "leafs".* FROM "leafs" WHERE "leafs"."sha" = x'62323433636465306164623031333136316136646430666661336339313137343666343762316136' LIMIT 1
SELECT "nodes".* FROM "nodes" WHERE "nodes"."sha" = x'62323433636465306164623031333136316136646430666661336339313137343666343762316136' LIMIT 1
---
	def lookup

		# find the node that corresponds with the given coordinates

		# make sure all the params are set other return null
		if (params[:lat] && params[:lon] && params[:alt])
			@leaf_to_verify = Leaf.find_by_coordinates(params[:lat].to_f, params[:lon].to_f, params[:alt].to_f)

			@response = nil
			# only get intermediate nodes if a match was found
			if(@leaf_to_verify)
				@node_to_verify = Node.find_by_sha(@leaf_to_verify.sha)