app/controllers/leafs_controller.rb

SELECT "leafs".* FROM "leafs"
---
  def index
    @leafs = Leaf.all

SELECT "leafs".* FROM "leafs" WHERE "leafs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @leaf = Leaf.find(params[:id])

SELECT "leafs".* FROM "leafs" WHERE "leafs"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @leaf = Leaf.find(params[:id])

INSERT INTO "leafs" ("alt0", "alt1", "certificate_content_type", "certificate_file_name", "certificate_file_size", "certificate_updated_at", "created_at", "lat0", "lat1", "lon0", "lon1", "name", "sha", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @leaf = Leaf.new(params[:leaf])

    respond_to do |format|
      if @leaf.save

SELECT "leafs".* FROM "leafs" WHERE "leafs"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "leafs" SET "sha" = x'30326331643263313963313166323837623461333436613432306430623234326162356633333638', "certificate_file_name" = 'www.facebook.com', "certificate_file_size" = 976, "certificate_updated_at" = '2012-11-28 02:52:28.548232', "updated_at" = '2012-11-28 02:52:28.552828' WHERE "leafs"."id" = 16
---
  def update
    @leaf = Leaf.find(params[:id])

    # hash certificate
    begin
      @leaf.sha = Digest::SHA1.file(@leaf.certificate.path).hexdigest
    rescue
    end

    respond_to do |format|
      if @leaf.update_attributes(params[:leaf])

SELECT "leafs".* FROM "leafs" WHERE "leafs"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "leafs" WHERE "leafs"."id" = ?  [["id", 2]]
---
  def destroy
    @leaf = Leaf.find(params[:id])
    @leaf.destroy